import { useState } from "react";

const Disclaimer = () => {
    const [upDown, setUpDown] = useState(true)
    const handleClick =()=>{
        upDown ? setUpDown(false) : setUpDown(true)
    }
  return (
    <div className="flex flex-col gap-5 text-white items-start">
      <button className="font-medium text-base outline-none" onClick={handleClick}>
        Дисклеймер {upDown ? " ▲" : " ▼"}
      </button>
      {upDown && (
        <div className="text-[#939697] text-xs sm:text-sm font-light">
          TANK 300 за 3 799 000руб с учетом поддержек. Цена на модель TANK
          (ТЭНК) 300 в комплектации Adventure (Эдвенчер) с двигателем 2,0T 4WD,
          2023 года производства, цвет автомобиля: белый, с учетом выгоды по
          трейд-ин 300 000 рублей. В трейд-ин принимаются автомобили с пробегом
          со сроком владения и регистрации (постановки на учет) в органах ГИБДД
          не менее 6 месяцев (в отношении автомобилей бренда TANK, Haval, Great
          Wall – 3 месяца) до сдачи автомобиля в трейд-ин. В качестве
          документов, подтверждающих срок владения сдаваемого в трейд-ин
          автомобиля, собственнику необходимо предоставить копию ПТС или СТС или
          карточку учета ТС из ГИБДД с печатью и подписью. Подробности уточняйте
          у менеджеров отдела продаж TANK АВТОРУСЬ. Предложение ограничено, не
          является офертой и действует с 01.04.2024г. <br /> TANK 500 за 5 349
          000 руб с учетом поддержек. Цена на модель TANK (ТЭНК) 500 в
          комплектации Adventure (Эдвенчер) с двигателем 3,0T 4WD, 2023 года
          производства, цвет автомобиля: белый, с учетом прямой выгоды в 950 000
          рублей. Подробности уточняйте у менеджеров отдела продаж TANK
          АВТОРУСЬ. Предложение ограничено, не является офертой и действует с
          01.04.2024г.
        </div>
      )}
    </div>
  );
}

export default Disclaimer